---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IExternalCommand
source: html/850475b4-01d3-8247-4515-e53ab1e73e65.htm
---
# IExternalCommand Members

Overload this method to implement and external command within Revit.